{ "translations": {
    "Could not find related LDAP entry" : "Kunne ikke finde relateret LDAP-post",
    "DisplayName change rejected" : "Ændring af displaynavn blev afvist",
    "Write support for LDAP" : "Skriv support til LDAP",
    "Adds support for creating, manipulating and deleting users and groups on LDAP via Nextcloud" : "Tilføjer understøttelse til at oprette, manipulere og slette brugere og grupper på LDAP via Nextcloud",
    "Failed to set user template." : "Kunne ikke indstille brugerskabelon.",
    "Failed to set switch." : "Kunne ikke indstille switch.",
    "Writing" : "Skriver",
    "Switches" : "Switches",
    "Prevent fallback to other backends when creating users or groups." : "Undgå fallbacks til andre backends, når du opretter brugere eller grupper.",
    "To create users, the acting (sub)admin has to be provided by LDAP." : "For at oprette brugere skal den fungerende (under) administrator stilles til rådighed af LDAP.",
    "A random user ID has to be generated, i.e. not being provided by the (sub)admin." : "Der skal genereres et tilfældigt bruger-id, det vil sige, at det ikke er leveret af (under) administratoren.",
    "An LDAP user must have an email address set." : "En LDAP-bruger skal have en e-mailadresse indstillet.",
    "Allow users to set their avatar" : "Tillad brugere at indstille deres avatar",
    "User template" : "Bruger skabelon",
    "LDIF template for creating users. Following placeholders may be used" : "LDIF skabelon til oprettelse af brugere. Følgende pladsholdere kan bruges",
    "the user id provided by the (sub)admin" : "det bruger-id, der er angivet af (under) administratoren",
    "the password provided by the (sub)admin" : "adgangskoden leveret af (under) administratoren",
    "the LDAP node of the acting (sub)admin or the configured user base" : "LDAP-noden for den fungerende (under) administrator eller den konfigurerede brugerbase",
    "The write support for LDAP enriches the LDAP backend with capabilities to manage the directory from Nextcloud.\n* create, edit and delete users\n* create, modify memberships and delete groups\n* prevent fallback to the local database backend (optional)\n* auto generate a user id (optional)\n* and more behavioral switches" : "Skriveunderstøttelsen til LDAP beriger LDAP-backend med muligheder for at administrere mappen fra Nextcloud.\n* opret, rediger og slette brugere\n* opret, rediger medlemskaber og slette grupper\n* forhindre tilbagefald til den lokale database-backend (valgfrit)\n* generer automatisk et bruger-id (valgfrit)\n* og flere adfærdsmæssige skift"
},"pluralForm" :"nplurals=2; plural=(n != 1);"
}