{ "translations": {
    "Could not find related LDAP entry" : "Níorbh fhéidir an iontráil LDAP gaolmhar a aimsiú",
    "DisplayName change rejected" : "Diúltaíodh don athrú DisplayName",
    "Write support for LDAP" : "Scríobh tacaíocht do LDAP",
    "Adds support for creating, manipulating and deleting users and groups on LDAP via Nextcloud" : "Cuirtear leis tacaíocht chun úsáideoirí agus grúpaí ar LDAP a chruthú, a ionramháil agus a scriosadh trí Nextcloud",
    "The write support for LDAP enriches the LDAP backend with capabilities to manage the directory from Nextcloud.\n* create, edit and delete users\n* create, modify memberships and delete groups\n* prevent fallback to the local database backend (optional)\n* auto generate a user ID (optional)\n* and more behavioral switches" : "Saibhríonn an tacaíocht scríofa do LDAP inneall an LDAP le cumais chun an t-eolaire ó Nextcloud a bhainistiú.\n* úsáideoirí a chruthú, a chur in eagar agus a scriosadh\n* ballraíocht a chruthú, a mhodhnú agus grúpaí a scriosadh\n* cosc ​​a chur ar chúltaca chuig inneall an bhunachair shonraí áitiúil (roghnach)\n* giniúint uathoibríoch aitheantais úsáideora (roghnach)\n* agus lasca iompraíochta níos mó",
    "Failed to set user template." : "Theip ar an teimpléad úsáideora a shocrú.",
    "Failed to set switch." : "Theip ar an lasc a shocrú.",
    "Writing" : "Ag scríobh",
    "Switches" : "Lasca",
    "Prevent fallback to other backends when creating users or groups." : "Cosc a chur ar aisiompair eile nuair a bhíonn úsáideoirí nó grúpaí á gcruthú.",
    "To create users, the acting (sub)admin has to be provided by LDAP." : "Chun úsáideoirí a chruthú, ní mór do LDAP an riarthóir gníomhach (fo) a sholáthar.",
    "A random user ID has to be generated, i.e. not being provided by the (sub)admin." : "Ní mór aitheantas úsáideora randamach a ghiniúint, i.e. níl sé á sholáthar ag an (fo)riarthóir.",
    "An LDAP user must have an email address set." : "Ní mór go mbeadh tacar seoltaí ríomhphoist ag úsáideoir LDAP.",
    "Allow users to set their avatar" : "Lig d'úsáideoirí a n-avatar a shocrú",
    "Allow users to set their password" : "Lig d’úsáideoirí a bpasfhocal a shocrú",
    "If the server does not support the modify password extended operation use the `unicodePwd` instead of the `userPassword` attribute for setting the password" : "Mura dtacaíonn an freastalaí leis an oibríocht leathnaithe an phasfhocail a mhionathrú úsáid an `unicodePwd` in ionad an aitreabúid `userPassword` chun an pasfhocal a shocrú",
    "Use the `unicodePwd` attribute for setting the user password" : "Úsáid an aitreabúid `unicodePwd` chun an pasfhocal úsáideora a shocrú",
    "User template" : "Teimpléad úsáideora",
    "LDIF template for creating users. Following placeholders may be used" : "Teimpléad LDIF chun úsáideoirí a chruthú. Is féidir na háitsealbhóirí seo a leanas a úsáid",
    "the user id provided by the (sub)admin" : "an t-aitheantas úsáideora a sholáthraíonn an (fo)riarthóir",
    "the password provided by the (sub)admin" : "an pasfhocal a sholáthraíonn an (fo)riarthóir",
    "the LDAP node of the acting (sub)admin or the configured user base" : "nód LDAP an riarthóra gníomhaigh (fo) nó an bonn úsáideora cumraithe"
},"pluralForm" :"nplurals=5; plural=(n==1 ? 0 : n==2 ? 1 : n<7 ? 2 : n<11 ? 3 : 4);"
}