{ "translations": {
    "Could not find related LDAP entry" : "Non foi posíbel atopar a entrada LDAP relacionada",
    "DisplayName change rejected" : "Cambio en DisplayName rexeitado",
    "Write support for LDAP" : "Compatibilidade de escritura para LDAP",
    "Adds support for creating, manipulating and deleting users and groups on LDAP via Nextcloud" : "Engade compatibilidade para crear, manipular e eliminar usuarios e grupos en LDAP a través de Nextcloud",
    "The write support for LDAP enriches the LDAP backend with capabilities to manage the directory from Nextcloud.\n* create, edit and delete users\n* create, modify memberships and delete groups\n* prevent fallback to the local database backend (optional)\n* auto generate a user ID (optional)\n* and more behavioral switches" : "A compatibilidade de escritura para LDAP mellora a infraestrutura LDAP con capacidades para xestionar o directorio desde Nextcloud.\n* crear, editar e eliminar usuarios\n* crear, modificar pertenzas e eliminar grupos\n* evitar o retorno cara a infraestrutura da base de datos local (opcional)\n* xerar automaticamente un ID de usuario (opcional)\n* e máis conmutadores de comportamento",
    "Failed to set user template." : "Produciuse un fallo ao definir o modelo de usuario.",
    "Failed to set switch." : "Produciuse un fallo ao definir o conmutador.",
    "Writing" : "Escribindo",
    "Switches" : "Conmutadores",
    "Prevent fallback to other backends when creating users or groups." : "Evitar o retorno a outras infraestruturas crear usuarios ou grupos.",
    "To create users, the acting (sub)admin has to be provided by LDAP." : "Para crear usuarios, a (sub)admin actuante debe ser fornecida por LDAP.",
    "A random user ID has to be generated, i.e. not being provided by the (sub)admin." : "Hai que xerar un ID de usuario ao chou, é dicir. non debe ser fornecido por (sub)admin.",
    "An LDAP user must have an email address set." : "Un usuario LDAP debe tener definido un enderezo de correo.",
    "Allow users to set their avatar" : "Permitirlle aos usuarios definir o seu avatar",
    "Allow users to set their password" : "Permitirlle aos usuarios definir o seu contrasinal",
    "If the server does not support the modify password extended operation use the `unicodePwd` instead of the `userPassword` attribute for setting the password" : "Se o servidor non admite a operación ampliada de modificación do contrasinal, use «unicodePwd» en troques do atributo «userPassword» para axustar o contrasinal",
    "Use the `unicodePwd` attribute for setting the user password" : "Use o atributo «unicodePwd» para axustar o contrasinal do usuario",
    "User template" : "Modelo de usuario",
    "LDIF template for creating users. Following placeholders may be used" : "Modelo LDIF para crear usuarios. Pódense empregar os seguintes marcadores de substitución",
    "the user id provided by the (sub)admin" : "o id de usuario fornecido por (sub)admin",
    "the password provided by the (sub)admin" : "o contrasinal fornecido por (sub)admin",
    "the LDAP node of the acting (sub)admin or the configured user base" : "o nodo LDAP da (sub)admin actuante ou a base de usuarios configurada"
},"pluralForm" :"nplurals=2; plural=(n != 1);"
}