{ "translations": {
    "Could not find related LDAP entry" : "Não foi possível encontrar a entrada LDAP relacionada",
    "DisplayName change rejected" : "Alteração de DisplayName rejeitada",
    "Write support for LDAP" : "Suporte de gravação para LDAP",
    "Adds support for creating, manipulating and deleting users and groups on LDAP via Nextcloud" : "Adiciona suporte para criação, manipulação e exclusão de usuários e grupos no LDAP via Nextcloud",
    "The write support for LDAP enriches the LDAP backend with capabilities to manage the directory from Nextcloud.\n* create, edit and delete users\n* create, modify memberships and delete groups\n* prevent fallback to the local database backend (optional)\n* auto generate a user id (optional)\n* and more behavioral switches" : "O suporte de gravação para LDAP enriquece o back-end LDAP com recursos para gerenciar o diretório do Nextcloud. \n* criar, editar e excluir usuários \n* criar, modificar associações e excluir grupos \n* evitar fallback para o back-end do banco de dados local (opcional) \n* gerar automaticamente um ID de usuário (opcional) \n* e mais mudanças comportamentais",
    "Writing" : "Escrita",
    "Switches" : "Comutas",
    "Prevent fallback to other backends when creating users or groups." : "Evite o fallback para outros back-ends ao criar usuários ou grupos.",
    "To create users, the acting (sub)admin has to be provided by LDAP." : "Para criar usuários, o (sub)administrador atuante deve ser fornecido pelo LDAP.",
    "A random user ID has to be generated, i.e. not being provided by the (sub)admin." : "Um ID de usuário aleatório deve ser gerado, ou seja, não fornecido pelo (sub)administrador.",
    "An LDAP user must have an email address set." : "Um usuário LDAP deve ter um endereço de e-mail definido.",
    "Allow users to set their avatar" : "Permitir que os usuários definam seu avatar",
    "User template" : "Modelo de usuário",
    "LDIF template for creating users. Following placeholders may be used" : "Modelo LDIF para criação de usuários. Os seguintes espaços reservados podem ser usados",
    "the user id provided by the (sub)admin" : "o ID do usuário fornecido pelo (sub)administrador",
    "the password provided by the (sub)admin" : "a senha fornecida pelo (sub)administrador",
    "the LDAP node of the acting (sub)admin or the configured user base" : "o nó LDAP do (sub)administrador atuante ou da base de usuários configurada",
    "Failed to set user template." : "Falha ao definir o modelo do usuário.",
    "Failed to set switch." : "Falha ao definir o interruptor."
},"pluralForm" :"nplurals=3; plural=(n == 0 || n == 1) ? 0 : n != 0 && n % 1000000 == 0 ? 1 : 2;"
}